Operations in pandas

In [54]:
import pandas as pd

In [55]:
# Loading data
df = pd.read_csv("people_data.csv")
print(df.head()) # outputs first few (5) rows of the dataframe

  First Name Last Name   Age     Sex                       Email  \
0     Shelby   Terrell  43.0    Male        elijah57@example.net
1    Phillip   Summers  34.0  Female       bethany14@example.com
2   Kristine    Travis  32.0    Male       bthompson@example.com
3    Yesenia  Martinez   NaN    Male   kaitlinkaiser@example.com
4       Lori      Todd  24.0    Male  buchananmanuel@example.net

  Date of birth           Job Title
0    1945-10-26     Games developer
1    1910-03-24      Phytotherapist
2    1992-07-02           Homeopath
3    2017-08-03   Market researcher
4    1938-12-01  Veterinary surgeon

In [56]:
print(df.info()) # metadata of the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   First Name     5 non-null      object
 1   Last Name      5 non-null      object
 2   Age            4 non-null      float64
 3   Sex            5 non-null      object
 4   Email          5 non-null      object
 5   Date of birth  5 non-null      object
 6   Job Title      5 non-null      object
dtypes: float64(1), object(6)
memory usage: 476.0+ bytes
None

In [57]:
# Handling missing data
print(df.isnull().sum)
df = df.fillna(0)  # replaces missing values with 0

<bound method DataFrame.sum of    First Name  Last Name    Age    Sex  Email  Date of birth  Job Title
0       False      False  False  False  False          False      False
1       False      False  False  False  False          False      False
2       False      False  False  False  False          False      False
3       False      False   True  False  False          False      False
4       False      False  False  False  False          False      False>

In [58]:
# Selecting and filtering data
ages = df[df['Age'] > 25]
print(ages)

  First Name Last Name   Age     Sex                  Email Date of birth  \
0     Shelby   Terrell  43.0    Male   elijah57@example.net    1945-10-26
1    Phillip   Summers  34.0  Female  bethany14@example.com    1910-03-24
2   Kristine    Travis  32.0    Male  bthompson@example.com    1992-07-02

         Job Title
0  Games developer
1   Phytotherapist
2        Homeopath

In [62]:
# Adding and removing columns
df["Real Age"] = 2025 - df["Date of birth"].str.split("-").str[0].astype(int)

In [63]:
df.head()

,First Name,Last Name,Age,Sex,Email,Date of birth,Job Title,Real Age
0,Shelby,Terrell,43.0,Male,elijah57@example.net,1945-10-26,Games developer,80
1,Phillip,Summers,34.0,Female,bethany14@example.com,1910-03-24,Phytotherapist,115
2,Kristine,Travis,32.0,Male,bthompson@example.com,1992-07-02,Homeopath,33
3,Yesenia,Martinez,0.0,Male,kaitlinkaiser@example.com,2017-08-03,Market researcher,8
4,Lori,Todd,24.0,Male,buchananmanuel@example.net,1938-12-01,Veterinary surgeon,87

In [65]:
# Grouping data
response = df.groupby('First Name')['Real Age'].sum()
print(response)

First Name
Kristine     33
Lori         87
Phillip     115
Shelby       80
Yesenia       8
Name: Real Age, dtype: int64